Revit 2027 API
BuiltInFailures.MechanicalFailures.TwoPointsSelectedBeforeEdit Property
 Two points have to be selected before existing the edit mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TwoPointsSelectedBeforeEdit { get; }
Public Shared ReadOnly Property TwoPointsSelectedBeforeEdit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TwoPointsSelectedBeforeEdit {
	FailureDefinitionId^ get ();
}
static member TwoPointsSelectedBeforeEdit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace